Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridlinesOutOfBounds Property
 Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridlinesOutOfBounds { get; }
Public Shared ReadOnly Property GridlinesOutOfBounds As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridlinesOutOfBounds {
	FailureDefinitionId^ get ();
}
static member GridlinesOutOfBounds : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace